## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.aks_cluster will be created
  + resource "azurerm_kubernetes_cluster" "aks_cluster" {
      + automatic_upgrade_channel           = "patch"
      + azure_policy_enabled                = true
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "akscluster-dns"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = true
      + image_cleaner_interval_hours        = 168
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + local_account_disabled              = true
      + location                            = "northeurope"
      + name                                = "akscluster"
      + node_os_upgrade_channel             = "NodeImage"
      + node_resource_group                 = "akscluster-northeurope-node-rg"
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + resource_group_name                 = "akscluster-northeurope-aks-rg"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + tags                                = {
          + "Environment" = "Dev"
          + "Git"         = "github"
          + "Owner"       = "kmiszel"
          + "Purpose"     = "AKS"
          + "Source"      = "terraform"
        }
      + workload_identity_enabled           = false

      + auto_scaler_profile (known after apply)

      + azure_active_directory_role_based_access_control {
          + admin_group_object_ids = [
              + "44355144-d87d-4e26-818c-0fd9babacf9a",
            ]
          + azure_rbac_enabled     = true
          + tenant_id              = (known after apply)
        }

      + default_node_pool {
          + auto_scaling_enabled        = true
          + kubelet_disk_type           = (known after apply)
          + max_count                   = 3
          + max_pods                    = 110
          + min_count                   = 2
          + name                        = "agent"
          + node_count                  = 2
          + node_labels                 = (known after apply)
          + orchestrator_version        = (known after apply)
          + os_disk_size_gb             = (known after apply)
          + os_disk_type                = "Managed"
          + os_sku                      = (known after apply)
          + scale_down_mode             = "Delete"
          + temporary_name_for_rotation = "agenttemp"
          + type                        = "VirtualMachineScaleSets"
          + ultra_ssd_enabled           = false
          + vm_size                     = "Standard_D2s_v3"
          + vnet_subnet_id              = (known after apply)
          + workload_runtime            = (known after apply)
          + zones                       = [
              + "1",
              + "2",
              + "3",
            ]

          + upgrade_settings {
              + drain_timeout_in_minutes      = 0
              + max_surge                     = "10%"
              + node_soak_duration_in_minutes = 0
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + key_vault_secrets_provider {
          + secret_identity          = (known after apply)
          + secret_rotation_enabled  = true
          + secret_rotation_interval = "10m"
        }

      + kubelet_identity (known after apply)

      + maintenance_window_auto_upgrade {
          + day_of_week = "Sunday"
          + duration    = 4
          + frequency   = "Weekly"
          + interval    = 1
          + start_date  = "2024-10-22T00:00:00Z"
          + start_time  = "00:00"
          + utc_offset  = "+00:00"
        }

      + maintenance_window_node_os {
          + day_of_week = "Sunday"
          + duration    = 4
          + frequency   = "Weekly"
          + interval    = 1
          + start_date  = "2024-10-22T00:00:00Z"
          + start_time  = "00:00"
          + utc_offset  = "+00:00"
        }

      + network_profile {
          + dns_service_ip      = (known after apply)
          + ip_versions         = (known after apply)
          + load_balancer_sku   = "standard"
          + network_data_plane  = "cilium"
          + network_mode        = (known after apply)
          + network_plugin      = "azure"
          + network_plugin_mode = "overlay"
          + network_policy      = "cilium"
          + outbound_type       = "loadBalancer"
          + pod_cidr            = (known after apply)
          + pod_cidrs           = (known after apply)
          + service_cidr        = (known after apply)
          + service_cidrs       = (known after apply)

          + load_balancer_profile (known after apply)

          + nat_gateway_profile (known after apply)
        }

      + windows_profile (known after apply)
    }

  # azurerm_resource_group.aks-network_rg will be created
  + resource "azurerm_resource_group" "aks-network_rg" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "akscluster-northeurope-network-rg"
      + tags     = {
          + "Environment" = "Dev"
          + "Git"         = "github"
          + "Owner"       = "kmiszel"
          + "Purpose"     = "AKS"
          + "Source"      = "terraform"
        }
    }

  # azurerm_resource_group.aks_rg will be created
  + resource "azurerm_resource_group" "aks_rg" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "akscluster-northeurope-aks-rg"
      + tags     = {
          + "Environment" = "Dev"
          + "Git"         = "github"
          + "Owner"       = "kmiszel"
          + "Purpose"     = "AKS"
          + "Source"      = "terraform"
        }
    }

  # azurerm_subnet.aks_subnet will be created
  + resource "azurerm_subnet" "aks_subnet" {
      + address_prefixes                              = [
          + "10.224.0.0/16",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "akscluster-northeurope-subnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "akscluster-northeurope-network-rg"
      + virtual_network_name                          = "akscluster-northeurope-vnet"
    }

  # azurerm_virtual_network.aks_vnet will be created
  + resource "azurerm_virtual_network" "aks_vnet" {
      + address_space       = [
          + "10.224.0.0/12",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "akscluster-northeurope-vnet"
      + resource_group_name = "akscluster-northeurope-network-rg"
      + subnet              = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```
</details>